Documents/ВъездВыездАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВъездВыездАвтомобилей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АвтоНаТерритории</xr:Item>
				<xr:Item>AccumulationRegister.АвтоКомпанииНаТерритории</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВъезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникКому</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельВизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жетон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоЖетоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостыОхраны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/АвтоНаТерритории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>АвтоНаТерритории</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АвтоЖетон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоЖетоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВъездаВыезда</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВъездВыездАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/АвтоКомпанииНаТерритории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>АвтоКомпанииНаТерритории</Name>
			<Comment>Автомобили компании на территории</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВъездаВыезда</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВъездВыездАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВъездВыездАвтомобилей/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ЧУЖИЕ АВТО
	Если ЗначениеЗаполнено(Жетон) Тогда
	// регистр АвтоНаТерритории Приход
	Движения.АвтоНаТерритории.Записывать = Истина;
	Движение = Движения.АвтоНаТерритории.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = ДатаВремяВъезда;
	Движение.АвтоЖетон = Жетон;
	Движение.ДокументВъездаВыезда = Ссылка;
	Движение.Значение = 1;

	// регистр АвтоНаТерритории Расход
	Если ЗначениеЗаполнено(ДатаВремяВыезда) Тогда
		Движения.АвтоНаТерритории.Записывать = Истина;
		Движение = Движения.АвтоНаТерритории.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ДатаВремяВыезда;
		Движение.АвтоЖетон = Жетон;
		Движение.ДокументВъездаВыезда = Ссылка;
		Движение.Значение = 1;
	КонецЕсли;
	
	
	
	КонецЕсли;

	
	 //АВТО КОМПАНИИ
	 Если ЗначениеЗаполнено(Водитель) Тогда
	// регистр АвтоКомпанииНаТерритории Приход
	Движения.АвтоКомпанииНаТерритории.Записывать = Истина;
	Движение = Движения.АвтоКомпанииНаТерритории.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = ДатаВремяВъезда;
	Движение.Водитель = Водитель;
	Движение.ДокументВъездаВыезда = Ссылка;
	Движение.Значение = 1;

	// регистр АвтоКомпанииНаТерритории Расход
	Если ЗначениеЗаполнено(ДатаВремяВыезда) Тогда
		Движения.АвтоКомпанииНаТерритории.Записывать = Истина;
		Движение = Движения.АвтоКомпанииНаТерритории.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ДатаВремяВыезда;
		Движение.Водитель = Водитель;
		Движение.ДокументВъездаВыезда = Ссылка;
		Движение.Значение = 1;
	КонецЕсли;
	
	
	
	КонецЕсли;


	
	
	
КонецПроцедуры
